## Pandas 학습

### 라이브러리 추가
```python
!pip install pandas
```

In [39]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
```python
import pandas as pd
```

In [40]:
import pandas as pd

### 판다스 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터
- 열(column) 유니크 데이터의 하나하나 특성

In [41]:
## 딕셔너리로 DataFrame 객체 생성
data = {'이름':['이윤지','홍길동','김성국'], '나이':[28, 20, 29], '결혼':[True, False, False]}
df = pd.DataFrame(data=data)
df

    이름  나이     결혼
0  이윤지  28   True
1  홍길동  20  False
2  김성국  29  False

In [42]:
## 2차원 리스트 생성
data = [['이윤지', 28, '부산', 'dbswl341@naver.com', True],['홍길동', 20, '서울','ghdrlfehd@naver.com', False],
        ['김성국', 29, '경남', 'tjdrnr1217@naver.com', False]]
data

[['이윤지', 28, '부산', 'dbswl341@naver.com', True],
 ['홍길동', 20, '서울', 'ghdrlfehd@naver.com', False],
 ['김성국', 29, '경남', 'tjdrnr1217@naver.com', False]]

In [43]:
## 2차원 리스트 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소                   이메일     결혼
0  이윤지  28  부산    dbswl341@naver.com   True
1  홍길동  20  서울   ghdrlfehd@naver.com  False
2  김성국  29  경남  tjdrnr1217@naver.com  False

In [44]:
## DataFrame에서 데이터 조회(열)
df['이름']

0    이윤지
1    홍길동
2    김성국
Name: 이름, dtype: object

In [45]:
## 데이터프레임 조회(두개의 열)
df[['이름', '나이']]

    이름  나이
0  이윤지  28
1  홍길동  20
2  김성국  29

In [46]:
## 데이터프레임 행으로 조회
df.loc[0]

이름                    이윤지
나이                     28
주소                     부산
이메일    dbswl341@naver.com
결혼                   True
Name: 0, dtype: object

In [47]:
## 데이터프레임 조회(행)
df.loc[[0, 1]]

    이름  나이  주소                  이메일     결혼
0  이윤지  28  부산   dbswl341@naver.com   True
1  홍길동  20  서울  ghdrlfehd@naver.com  False

In [48]:
# 현재 데이터프레임 확인
df

    이름  나이  주소                   이메일     결혼
0  이윤지  28  부산    dbswl341@naver.com   True
1  홍길동  20  서울   ghdrlfehd@naver.com  False
2  김성국  29  경남  tjdrnr1217@naver.com  False

In [49]:
## 새 컬럼 추가
df['전번'] = ['01099999999','01088888888','01077777777']

In [50]:
#추가된 데이터 프레임 확인
df

    이름  나이  주소                   이메일     결혼           전번
0  이윤지  28  부산    dbswl341@naver.com   True  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  False  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  False  01077777777

In [52]:
## 열 삭제
df.drop('결혼', axis=1)

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777